filter表 与主机自身有关，负责主机防火墙功能的（过滤流入流出主机的数据包）。filter表是iptabls默认使用的表。这个表定义了三个链（Chains）

INPUT：负责过滤所有目标地址是本机地址的数据包。过滤进入主机的数据包
FORWARD：辅助转发流经主机的数据包。起转发的作用，和NAT关系很大 LVS NAT模式 net.ipv4.ip_forward=0
OUtPUT：处理所有源地址是本机地址的数据包，处理从主机发出去的数据包



NAT表:负责网络地址转换，即来源与目的ip地址和port的转换。应用：和主机本身无关。一般用于局域网共享上网或者特殊的端口转换服务相关。

NAT功能一般用于企业工作场景

1.用于企业路由（zebra）或网关（iptables），共享上网（POSTROUTING）
2.做内部外部IP地址一对一映射（dmz），硬件防火墙映射IP到内部服务器，ftp服务（PREROUTING）
3.web，单个端口的映射，直接映射80端口（PREROUTING）。这个表定义了三个链（chains），nat功能就相当于网络的acl控制。和网络交换机ACL类似。


OUTPUT  和主机发出去的数据包有关。改变主机发出数据包的目标地址
PRETOUTING 在数据包到达防火墙时进行路由判断之前执行的规则，作用是改变数据包的目的地址、目的端口等
POSTROUTING 在数据包离开防火墙时进行路由判断之后执行的规则，作用时改变数据包的源地址、源端口等



